var app = new Vue({
    el: "#app",
    methods: {
        showMoreInfo: function(item){
            this.modalData = item;
            const myModal = new bootstrap.Modal(document.querySelector('#moreInfo'))
            myModal.show();
        }
    },
    data: {
        modalData: {
            "title": "",
            "type": "",
            "owner": "",
            "email": "",
            "date": "",
            "committee": "",
            "description": "",
            "outcome": [""],
            "place": "",
            "vol_count": "",
            "pics": [
                '#',
            ]
        },
        wt1441: [
            {
                "title": "مبادرة حقيبة تعليمية إلكترونية للصفوف الأولية",
                "type": "مبادرة تطوعية",
                "owner": "د.سماء عطية وعدد من منسوبات الكلية",
                "email": "smattiyah@uj.edu.sa",
                "date": "20-4-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "مبادرة تطوعية لتجهيز وإعداد أوراق عمل وإثراءات علمية وذكر لبعض مصادر المعرفة لمواد الصفوف الأولية",
                "outcome":[
				"إستفادةأولياء الأمور  من هذه المبادرة وتوفير الوقت والجهد",
				"قدرة الطالب على التعلم الذاتي",
				"نشر المبادرة لدى الجهات المنفذة لاستفادة أكبر عدد من الطلاب منها",
				]
                "place": "مبادرة تطوعية عن بعد",
                "vol_count": "9",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "مبادرة إيزي إنجليزي",
                "type": "مبادرة تطوعية",
                "owner": "د.هبة الله عرابي وعدد من طالبات قسم اللغة الإنجليزية",
                "email": "haorabi@uj.edu.sa",
                "date": "20-4-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "مبادرة تطوعية لتبسيط اللغة الإنجليزية وتحويل مقررات القسم إلى إنفوجرافيك",
                "outcome": [
                "تعليم اللغة الإنجليزية وتبسيطها من خلال تقديمها في قالب مصور يسهل إستيعابه وتذكره",
                "إثراء المحتوى المعرفي لمقررات قسم اللغة الإنجليزية وتلخيص محتوياتها ليستفيد منها الطلاب الحاليون والقادمون في إستذكار دروسهم",
                "إكساب طالبات القسم مهارات التصميم وتلخيص المحتوى حيث أن جميع التصميمات من تنفيذ الطالبات. فقد قمنا بتدريبهم على تصميم الإنفوجرافيك بإستخدام برنامج الوورد فقط نظراً لسهولة إستخدامة وتوفرة لدى جميع الطالبات"],
                "place": "أونلاين  _ من خلال حساب على منصة تويتر خاص بالمبادرة @EZenglEZ ",
                "vol_count": "60",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "مبادرة حفظ النعمة",
                "type": "مبادرة تطوعية",
                "owner": "أ.مها السلمي - أ.زلفى السلمي",
                "email": "mmalsulami1@uj.edu.sa",
                "date": "21-4-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "مبادرة تطوعية لزرع القيم وتعزيزها لدى طالبات الجامعة لتصل لأفراد المجتمع عن طريق نشر ثقافة حفظ النعمة والتغلب على مظاهر البذخ والاسراف ، وابتكار الطرق والوسائل المتنوعة للحفاظ على النعمة",
                "outcome": [
				"احترام النعمة وشكرها لأن بشكرها تدوم النعم",
				"توعية المجتمع ونشر ثقافة حفظ النعم والحد من الإسراف والتبذير",
				"الحد من الأثار السلبية للمخلفات الغذائية",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "2",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "مبادرة أكرمك فأكرمة",
                "type": "مبادرة تطوعية",
                "owner": " د.سماء عطية وعدد من منسوبات الكلية",
                "email": "smattiyah@uj.edu.sa",
                "date": "11-5-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "تجميع المصاحف غير المستخدمة أو الممزقة لإعادتها لشكاها الصحيح وتوزيعها للمحتاجين إليها بجميع أنحاء العالم",
                "outcome": [
				"تشجيع الناس على حفظ القران الكريم وتكريمة",
				"إستفادة الأخرين المحتاجين من جميع أنحاء العالم",
				"إستفادة الغير ناطقين بالعربية من المصاحف المترجمة",
				],
                "place": "مساجد ومراكز مختلفة بجدة ومحافظة الكامل",
                "vol_count": "11",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة من عدوى فيروس كورونا",
                "type": "محاضرة",
                "owner": "د.هدى السيد , د.زينب هاشم",
                "email": "hemohammed@uj.edu.sa",
                "date": "10-3-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "لقاء حواري عن أعراض المرض وكيفية الوقاية",
                "outcome": [
				"توعية الحماية من الفيروس",
				"الإحترازات الضرورية للحماية",
				"توعية عن اللقتحات وضرورة التحصين",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "7",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة المرورية للمشاة",
                "type": "محاضرة",
                "owner": "د.فاطمة كساب",
                "email": "fkalhmoud@uj.edu.sa",
                "date": "24-7-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "محاضرة توعوية لتعريف بقواعد السلامة المرورية للمشاة",
                "outcome": [""],
                "place": "",
                "vol_count": "",
                "hours": "",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة المرورية لسائقي المركبات",
                "type": "محاضرة",
                "owner": "د.فاطمة كساب",
                "email": "fkalhmoud@uj.edu.sa",
                "date": "25-7-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "عمل تطوعي يهدف إلى زيادة الوعي بقواعد السلامة المرورية",
                "outcome": [
				"المساعدة على فهم لافتات المرور وكيفية قرائتها",
				"الحث على العمل بأحكام السلامة المرورية وكيفية التغلب على مخاطر الطريق",
				"رفع الوعي بمخاطر استخدام الهاتف أثناء القيادة",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "7",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة في استخدام الأدوية ومستحضرات التجميل",
                "type": "محاضرة ",
                "owner": "د.نورا العبادي",
                "email": "nalabadi@uj.edu.sa",
                "date": "3-8-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "لقاء حواري عن السلامة في استخدام مساحيق التجميل والفيتامينات",
                "outcome": [
				"توعية عن السلامة في اسإخدام مساحيق التجميل",
				"أضرار الأفراط في إستخدام الفيتامينات",
				"نصائح لبشرة جميلة صحية بدون مكياج",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "6",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة في معامل الحاسب الآلي",
                "type": "محاضرة",
                "owner": "أ.فاطمة السلمي",
                "email": "aeaalsulami1@uj.edu.sa",
                "date": "5-8-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "محاضرة تثقيفية وتوعوية لتعريف بوسائل السلامة في معامل الحاسب الآلي وكيف نحمي الأجهزة ضمن مبادرة السلامة في حياتنا اليومية",
                "outcome": [
				"",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "4",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "طرق اجتياز اختبار القدرات اللفظية",
                "type": "محاضرة",
                "owner": "د.زينب هاشم , د.فاطمة الرواشدة",
                "email": "",
                "date": "8-8-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "محاضرة تثقيفية لتعريف بالطريقة الصحيحة لاجتياز اختبار القدرات اللفظية",
                "outcome": ["التعريف بالطرق الصحيحة للاستعداد لاختبار القدرات اللفظية",
				"مدى أهمية الاستعداد النفسي والذهني للاختبار",],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "2",
                "pics": [
                    '#',
                ]
            }
        ],
    }
});
