var app = new Vue({
    el: "#app",
    methods: {
        showMoreInfo: function(item){
            this.modalData = item;
            const myModal = new bootstrap.Modal(document.querySelector('#moreInfo'))
            myModal.show();
        },
        setYear: function (e) {
            this.selectedYear = eval(e.target.value)
          },
    },
    created() {
        this.selectedYear = 0
    },
    data: {
        selectedYear: 0,
        modalData: {
            "title": "",
            "owner": "",
            "email": "",
            "date": "",
            "committee": "",
            "description": "",
            "outcome": [""],
            "place": "",
            "vol_count": "",
            "pics": [
                '#',
            ]
        },
        programs: [
            {
                year: "1442-1443",
                list: [
                    {
                        "title": "مبادرة أنتم في قلوبنا ولن ننساكم",
                        "owner": "د.نورا العبادي ",
                        "email": "nalabadi@uj.edu.sa ",
                        "date": "20-2-1443 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة توعوية تم عملها في عدة مدارس ثانوية في مدينة جدة ومحافظة الكامل ",
                        "outcome": [
                        "نشر الوعي بمرض الزهايمر",
                        "ارشادات التعامل مع مريض الزهايمر",
                        "الوعي بالأغذية المفيدة للوقاية من الزهايمر",
                        ],
                        "place": "عدة مدارس ثانوية بجدة والكامل",
                        "vol_count": "10",
                        "pics": [
                            '#',
                        ]
                    },
                    {
                        "title": "مبادرة أنا والطبيب",
                        "owner": "د.سماء عطية ",
                        "email": "smattiyah@uj.edu.sa ",
                        "date": "24-4-1443:15-5-1443 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة توعوية اجتماعية تهدف إلى توعية المجتمع صحياَ ",
                        "outcome": [
                        "نشر الوعي الصحي",
                        "التعاون مع أطباء من خارج الجامعة  وزرع روح العمل الخيري والاجتماعي وحب التطوع",
                        ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": "23",
                        "pics": [
                            '#',
                        ]
                    },
                    {
                        "title": "مبادرة الطريق إلى محبة الله",
                        "owner": "د.خاتمة حمود ",
                        "email": "",
                        "date": "20-2-1443 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة توعوية تم عملها في عدة مدارس ثانوية في مدينة جدة ومحافظة الكامل ",
                        "outcome": [
                        "نشر الوعي بمرض الزهايمر",
                        "ارشادات التعامل مع مريض الزهايمر",
                        "الوعي بالأغذية المفيدة للوقاية من الزهايمر",
                        ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": "3 ",
                        "pics": [
                            '#',
                        ]
                    },
                    {
                        "title": "مبادرة فطورك علينا",
                        "owner": "د.هبة الله عرابي ",
                        "email": "haorabi@uj.edu.sa ",
                        "date": "1-5-1443:5-5-1443 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة إجتماعية تهدف إلى توفير وجبات إفطار صحية من مأكولات ومشروبات وماء مجانية لطالبات الكلية",
                        "outcome": [
                        "توفير وجبات إفطار صحية متنوعة للطالبات",
                        "زرع روح العمل الخيري والاجتماعي وحب التطوع",
                        ],
                        "place": "كلية العلوم والآداب بالكامل",
                        "vol_count": "13",
                        "pics": [
                            '#',
                        ]
                    },
                    {
                        "title": "مبادرة سقيا الماء",
                        "owner": "",
                        "email": " ",
                        "date": "20-2-1443 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة توعوية تم عملها في عدة مدارس ثانوية في مدينة جدة ومحافظة الكامل ",
                        "outcome": [
                        "نشر الوعي بمرض الزهايمر",
                        "ارشادات التعامل مع مريض الزهايمر",
                        "الوعي بالأغذية المفيدة للوقاية من الزهايمر",
                        ],
                        "place": "عدة مدارس ثانوية بجدة والكامل",
                        "vol_count": "10",
                        "pics": [
                            '#',
                        ]
                    },
                ]
            },
            {
                year: "1441-1442",
                list: [
                    {
                        "title": "مبادرة حقيبة تعليمية إلكترونية للصفوف الأولية",
                        "owner": "د.سماء عطية وعدد من منسوبات الكلية",
                        "email": "smattiyah@uj.edu.sa",
                        "date": "20-4-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية لتجهيز وإعداد أوراق عمل وإثراءات علمية وذكر لبعض مصادر المعرفة لمواد الصفوف الأولية",
                        "outcome":[
                        "إستفادةأولياء الأمور  من هذه المبادرة وتوفير الوقت والجهد",
                        "قدرة الطالب على التعلم الذاتي",
                        "نشر المبادرة لدى الجهات المنفذة لاستفادة أكبر عدد من الطلاب منها",
                        ],
                        "place": "مبادرة تطوعية عن بعد",
                        "vol_count": "9",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/55998_electronic%20bag.jpg',
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/55999_electronic%20bag2.png',
                        ]
                    },
                    {
                        "title": "مبادرة إيزي إنجليزي",
                        "owner": "د.هبة الله عرابي وعدد من طالبات قسم اللغة الإنجليزية",
                        "email": "haorabi@uj.edu.sa",
                        "date": "20-4-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية لتبسيط اللغة الإنجليزية وتحويل مقررات القسم إلى إنفوجرافيك",
                        "outcome": [
                        "تعليم اللغة الإنجليزية وتبسيطها من خلال تقديمها في قالب مصور يسهل إستيعابه وتذكره",
                        "إثراء المحتوى المعرفي لمقررات قسم اللغة الإنجليزية وتلخيص محتوياتها ليستفيد منها الطلاب الحاليون والقادمون في إستذكار دروسهم",
                        "إكساب طالبات القسم مهارات التصميم وتلخيص المحتوى حيث أن جميع التصميمات من تنفيذ الطالبات. فقد قمنا بتدريبهم على تصميم الإنفوجرافيك بإستخدام برنامج الوورد فقط نظراً لسهولة إستخدامة وتوفرة لدى جميع الطالبات"],
                        "place": "أونلاين  _ من خلال حساب على منصة تويتر خاص بالمبادرة @EZenglEZ ",
                        "vol_count": "60",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56000_easyenglish.jpg',
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56001_easyenglish2.png',
                        ]
                    },
                    {
                        "title": "مبادرة حفظ النعمة",
                        "owner": "أ.مها السلمي - أ.زلفى السلمي",
                        "email": "mmalsulami1@uj.edu.sa",
                        "date": "21-4-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية لزرع القيم وتعزيزها لدى طالبات الجامعة لتصل لأفراد المجتمع عن طريق نشر ثقافة حفظ النعمة والتغلب على مظاهر البذخ والاسراف ، وابتكار الطرق والوسائل المتنوعة للحفاظ على النعمة",
                        "outcome": [
                        "احترام النعمة وشكرها لأن بشكرها تدوم النعم",
                        "توعية المجتمع ونشر ثقافة حفظ النعم والحد من الإسراف والتبذير",
                        "الحد من الأثار السلبية للمخلفات الغذائية",
                        ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": "2",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56008_save%20grace.jpg',
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56009_save%20grace2.jpg',
                        ]
                    },
                    {
                        "title": "مبادرة أكرمك فأكرمة",
                        "owner": " د.سماء عطية وعدد من منسوبات الكلية",
                        "email": "smattiyah@uj.edu.sa",
                        "date": "11-5-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "تجميع المصاحف غير المستخدمة أو الممزقة لإعادتها لشكاها الصحيح وتوزيعها للمحتاجين إليها بجميع أنحاء العالم",
                        "outcome": [
                        "تشجيع الناس على حفظ القران الكريم وتكريمة",
                        "إستفادة الأخرين المحتاجين من جميع أنحاء العالم",
                        "إستفادة الغير ناطقين بالعربية من المصاحف المترجمة",
                        ],
                        "place": "مساجد ومراكز مختلفة بجدة ومحافظة الكامل",
                        "vol_count": "11",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56002_quran.JPG',
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56003_quran2.JPG',
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56004_report.jpg',
                        ]
                    },
                    {
                        "title": "دثروهم2",
                        "owner": "أ.صافية السلمي",
                        "email": "skalsolami@uj.edu.sa",
                        "date": "25-6-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية لتوفير جاكيتات شتوية للمحتاجين وخاصة العمالة المقيمة بالمحافظة ووضعها بالمساجد ليسهل الحصول عليها",
                        "outcome": [
                        "مساعدة العمالة غير القادرين على توفير الملابس الشتوية لهم",
                        "حث المجتمع على الإحساس بالأخرين",
                        "بث روح التعاون بين أفراد المجتمع",
                        ],
                        "place": "مسجد الملك فهد بمحافظة الكامل",
                        "vol_count": "11",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56015_cover3.JPG',
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56013_coverthem.JPG',
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56014_cover2.JPG',
                        ]
                    },
                    {
                        "title": "السلامة المرورية للمشاة",
                        "owner": "د.فاطمة كساب",
                        "email": "fkalhmoud@uj.edu.sa",
                        "date": "24-7-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "محاضرة توعوية لتعريف بقواعد السلامة المرورية للمشاة",
                        "outcome": [""],
                        "place": "",
                        "vol_count": "",
                        "hours": "",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56011_traffic%20safety.jpg',
                        ]
                    },
                    {
                        "title": "السلامة المرورية لسائقي المركبات",
                        "owner": "د.فاطمة كساب",
                        "email": "fkalhmoud@uj.edu.sa",
                        "date": "25-7-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "عمل تطوعي يهدف إلى زيادة الوعي بقواعد السلامة المرورية",
                        "outcome": [
                        "المساعدة على فهم لافتات المرور وكيفية قرائتها",
                        "الحث على العمل بأحكام السلامة المرورية وكيفية التغلب على مخاطر الطريق",
                        "رفع الوعي بمخاطر استخدام الهاتف أثناء القيادة",
                        ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": "7",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56010_traffic%20safety%20for%20motorists.jpg',
                        ]
                    },
                    {
                        "title": "السلامة الصحية في ظل جائحة كورونا",
                        "owner": "د.هدى السيد , د.زينب هاشم",
                        "email": "hemohammed@uj.edu.sa",
                        "date": "1-8-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "لقاء حواري عن أعراض المرض وكيفية الوقاية",
                        "outcome": [
                        "توعية الحماية من الفيروس",
                        "الإحترازات الضرورية للحماية",
                        "توعية عن اللقتحات وضرورة التحصين",
                        ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": "7",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56006_safety%20in%20corona.jpg',
                        ]
                    },
                    {
                        "title": "السلامة في استخدام الأدوية ومستحضرات التجميل",
                        "owner": "د.نورا العبادي",
                        "email": "nalabadi@uj.edu.sa",
                        "date": "3-8-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "لقاء حواري عن السلامة في استخدام مساحيق التجميل والفيتامينات",
                        "outcome": [
                        "توعية عن السلامة في اسإخدام مساحيق التجميل",
                        "أضرار الأفراط في إستخدام الفيتامينات",
                        "نصائح لبشرة جميلة صحية بدون مكياج",
                        ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": "6",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56007_safety%20in%20the%20use%20of%20medicines.jpg',
                        ]
                    },
                    {
                        "title": "السلامة في معامل الحاسب الآلي",
                        "owner": "أ.فاطمة السلمي",
                        "email": "aeaalsulami1@uj.edu.sa",
                        "date": "5-8-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "محاضرة تثقيفية وتوعوية لتعريف بوسائل السلامة في معامل الحاسب الآلي وكيف نحمي الأجهزة ضمن مبادرة السلامة في حياتنا اليومية",
                        "outcome": [
                        "التعريف بقواعد السلامة في التعامل مع جهاز الحاسب الآلي من حيث الجلسة الصحيحة وكيف نحافظ على سلامة النظر",
                            "التعرف على قواعد السلامة داخل المعمل وكيفية حماية الأجهزة داخل المعمل",
                            "التعرف على وسائل الأمن والسلامة التي يجب توفرها في المعمل",
                    ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": "4",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56012_%D8%B4%D8%B1%D9%8A%D8%AD%D8%A91.JPG',
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56017_labsafety.png',
                        ]
                    },
                    {
                        "title": "السلامة المنزلية لكبار السن وذوي الاحتياجات الخاصة",
                        "owner":  "د.فاطمة الرواشدة",
                        "email": "",
                        "date": "25-8-1442",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "محاضرة تثقيفية وتوعوية لتعريف بقواعد السلامة المنزلية لكبار السن وذوي الاحتياجات الخاصة",
                        "outcome": ["أهميةالتعامل مع كبارالسن وذوي الاحتياجات الخاصة",
                        "التوعية بوسائل السلامة المنزلية",
                    ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": "2",
                        "pics": [
                            'https://www.uj.edu.sa/Files/856/Galleries/7280/56005_home%20safety.jpg',
                        ]
                    }
                ]
            },
             {
                year: "1440-1441",
                list: [
                      {
                        "title": "مبادرة نتعلم يداً بيد",
                        "owner": " د.سامية المفتاح",
                        "email": " ",
                        "date": "4-4-1441 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية تستهدف تعليم عدد من كبار السن لمحوالأمية  ",
                        "outcome": [
                        "مساعدة المجتمع بالكامل لمحو الأمية",
                        "مساعدة الكبار في القراءة والحساب وقراءة القران ومحو الأمية بينهم",
                        ],
                        "place": "مقر الكلية",
                        "vol_count": " ",
                        "pics": [
                            '#',
                        ]
                    },
                    {
                        "title": "مبادرة بالتعاون نتعلم",
                        "owner": " د.عواطف الحويطي",
                        "email": " ",
                        "date": "6-4-1441 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية تستهدف طالبات السنة التحضيرية لمساعدتهم بدروس تقوية في المواد العلمية بشكل عام ومادة الرياضيات بشكل خاص ",
                        "outcome": [
                        "مساعدة طالبات التحضيري بدروس تقوية لمادة الرياضيات",
                        "تقوية من يحتاج من الطالبات في المواد العلمية",
                        ],
                        "place": "قاعة السيمنار بالكلية",
                        "vol_count": " ",
                        "pics": [
                            '#',
                        ]
                    },
                    {
                        "title": "مبادرة خدمة بيوت الله",
                        "owner": " د.زينب هاشم",
                        "email": " ",
                        "date": "7-4-1441 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية تستهدف عدد من المساجد بمحافظة الكامل ",
                        "outcome": [
                        "توفير الخدمات اللازمة للمساجد والحفاظ على الشكل العام للمساجد",
                        "التبرع بالماء،سجاد الصلاة والمنظفات وغيرها",
                        ],
                        "place": "عدد من المساجد بمحافظة",
                        "vol_count": " ",
                        "pics": [
                            '#',
                        ]
                    },
                       {
                        "title": "مبادرة معرض إبداع الأنامل لدعم الأسر المنتجة",
                        "owner": "د.سماء عطية والطاقم الإداري بالكلية",
                        "email": "sm ",
                        "date": "20-6-1441 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية لدعم الاسر المنتجة ",
                        "outcome": [
                        "فعالية مجتمعية تهدف لدعم الشراكة المجتمعية بين الجامعة والأسر المنتجة بالمجتمع",
                        "دعم وتحفيز الأسر المنتجة لإبراز أفضل مالديهم",
                        "توعية الطالبات لثقافة العمل اليدوي",
                        ],
                        "place": "كلية العلوم والآداب بالكلية",
                        "vol_count": "6",
                        "pics": [
                            '#',
                        ]
                    },
                       {
                        "title": "مبادرة موعد أعمى مع كتاب",
                        "owner": " أ.أشواق السلمي",
                        "email": "agalsolami@uj.edu.sa",
                        "date": "1-7-1441 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة تطوعية ثقافية للتعريف بثقافة الكتب المستعملة وإعادة إستخدامها وتغليفها بطريقة جميلة وكاملة بدون معرفة العنوان وتلخيصها بطريقة تشويقية لإكتشاف محتواها في مابعد وإهدائها لمحبي القراءة مجاناً ",
                        "outcome": [
                        "فعالية ثقافية لنشر أهمية الكتب المستعملة ونشر الوعي القرائي في مختلف المجالات لمختلف الأعمار",
                        "جمع الكتب المستعملة بالتعاون مع أكثر من مدرسة داخل المحافظة وخارجها",
                        "تغليف الكتب بطريقة جميلة لإهدائها لمحبي القراءة",
                        "توفير بطاقات إهداء لزوار المعرض لمن يريد إهداء الكتاب ",
                        ],
                        "place": "كلية العلوم والآداب بالكامل",
                        "vol_count": "4",
                        "pics": [
                            '#',
                        ]
                    },
                      {
                        "title": "مبادرة تثقيفية بعنوان فايروس كورونا وكيفية الوقاية منه",
                        "owner": " ",
                        "email": " ",
                        "date": "10-9-1441 ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "محاضرة تثقيفية للطلاب والطالبات عن فايروس كورونا بالتعاون مع مستشفى الكامل ",
                        "outcome": [
                        "تعريف بالفايروس وطرق انتشاره",
                        "توعية بالإحترازات الضرورية للحماية",
                        ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": " ",
                        "pics": [
                            '#',
                        ]
                    
                    },
                    {
                        "title": "مبادرة توعوية بعنوان الوقاية خير من العلاج",
                        "owner": " ",
                        "email": " ",
                        "date": "10-9-1441",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة توعوية للإشراف على سكن العمال بالشركة المشغلة لمباني الجامعة بالفرع وتزويدهم بالمعقمات والتنسيق مع الجهات الصحية بالمحافظة للكشف عليهم بشكل دوري ",
                        "outcome": [
                        "الاهتمام والاشراف على سكن العمال وتزويدهم بالمعقمات",
                        "التنسيق مع الجهات الصحية بالمحافظة للكشف على العمال بشكل دوري ومنظم",
                        ],
                        "place": "سكن العمال بالشركة",
                        "vol_count": " ",
                        "pics": [
                            '#',
                        ]
                    },
                
                    {
                        "title": "مبادرة إعلامية بعنوان صحتك تهمنا",
                        "owner": " ",
                        "email": " ",
                        "date": " ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة إعلامية عبارة عن بث رسائل للطلاب والطالبات عبر ايميلاتهم الجامعية ومجموعات الواتساب والاخذ بما فيها من توجيهات حسب منشورات وزارة الصحة ",
                        "outcome": [
                        "توعية الطلاب والطالبات بمستجدات فايروس كورونا بإستمرار من خلال الرسائل",
                        "حث الطلاب والطالبات على نشر الرسائل في أسرهم والأخذ بما فيها",
                        ],
                        "place": "عبر البريد الإلكتروني والواتساب",
                        "vol_count": " ",
                        "pics": [
                            '#',
                        ]
                    },
                    {
                        "title": "مبادرة توعوية بعنوان التطوع مبدأ",
                        "owner": " ",
                        "email": " ",
                        "date": " ",
                        "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                        "description": "مبادرة توعوية لحث الطلاب والطالبات للتسجيل عبر منصة العمل التطوعي او التطوع الصحي التي أطلقتها وزارة الموارد البشرية والتنمية الإجتماعية ",
                        "outcome": [
                        "تعريف الطلاب والطالبات بمنصة العمل التطوعية وحثهم على التسجيل",
                        "حث الطلاب والطالبات على الإطلاع على المحاضرات الإلكترونية التي تنشرها الجهات الصحية عبر منصاتها",
                        ],
                        "place": "عبر منصة البلاك بورد",
                        "vol_count": " ",
                        "pics": [
                            '#',
                        ]
                    },
                ]
            },
        ]
    }
});
