var app = new Vue({
    el: "#app",
    methods: {
        showMoreInfo: function(item){
            this.modalData = item;
            const myModal = new bootstrap.Modal(document.querySelector('#moreInfo'))
            myModal.show();
        }
    },
    data: {
        modalData: {
            "title": "",
            "owner": "",
            "email": "",
            "date": "",
            "committee": "",
            "description": "",
            "outcome": [""],
            "place": "",
            "vol_count": "",
            "pics": [
                '#',
            ]
        },
        wt1441: [
            {
                "title": "مبادرة حقيبة تعليمية إلكترونية للصفوف الأولية",
                "owner": "د.سماء عطية وعدد من منسوبات الكلية",
                "email": "smattiyah@uj.edu.sa",
                "date": "20-4-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "مبادرة تطوعية لتجهيز وإعداد أوراق عمل وإثراءات علمية وذكر لبعض مصادر المعرفة لمواد الصفوف الأولية",
                "outcome":[
				"إستفادةأولياء الأمور  من هذه المبادرة وتوفير الوقت والجهد",
				"قدرة الطالب على التعلم الذاتي",
				"نشر المبادرة لدى الجهات المنفذة لاستفادة أكبر عدد من الطلاب منها",
				],
                "place": "مبادرة تطوعية عن بعد",
                "vol_count": "9",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/55998_electronic%20bag.jpg',
		    'https://www.uj.edu.sa/Files/856/Galleries/7280/55999_electronic%20bag2.png',
                ]
            },
            {
                "title": "مبادرة إيزي إنجليزي",
                "owner": "د.هبة الله عرابي وعدد من طالبات قسم اللغة الإنجليزية",
                "email": "haorabi@uj.edu.sa",
                "date": "20-4-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "مبادرة تطوعية لتبسيط اللغة الإنجليزية وتحويل مقررات القسم إلى إنفوجرافيك",
                "outcome": [
                "تعليم اللغة الإنجليزية وتبسيطها من خلال تقديمها في قالب مصور يسهل إستيعابه وتذكره",
                "إثراء المحتوى المعرفي لمقررات قسم اللغة الإنجليزية وتلخيص محتوياتها ليستفيد منها الطلاب الحاليون والقادمون في إستذكار دروسهم",
                "إكساب طالبات القسم مهارات التصميم وتلخيص المحتوى حيث أن جميع التصميمات من تنفيذ الطالبات. فقد قمنا بتدريبهم على تصميم الإنفوجرافيك بإستخدام برنامج الوورد فقط نظراً لسهولة إستخدامة وتوفرة لدى جميع الطالبات"],
                "place": "أونلاين  _ من خلال حساب على منصة تويتر خاص بالمبادرة @EZenglEZ ",
                "vol_count": "60",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56000_easyenglish.jpg',
		    'https://www.uj.edu.sa/Files/856/Galleries/7280/56001_easyenglish2.png',
                ]
            },
            {
                "title": "مبادرة حفظ النعمة",
                "owner": "أ.مها السلمي - أ.زلفى السلمي",
                "email": "mmalsulami1@uj.edu.sa",
                "date": "21-4-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "مبادرة تطوعية لزرع القيم وتعزيزها لدى طالبات الجامعة لتصل لأفراد المجتمع عن طريق نشر ثقافة حفظ النعمة والتغلب على مظاهر البذخ والاسراف ، وابتكار الطرق والوسائل المتنوعة للحفاظ على النعمة",
                "outcome": [
				"احترام النعمة وشكرها لأن بشكرها تدوم النعم",
				"توعية المجتمع ونشر ثقافة حفظ النعم والحد من الإسراف والتبذير",
				"الحد من الأثار السلبية للمخلفات الغذائية",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "2",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56008_save%20grace.jpg',
		    'https://www.uj.edu.sa/Files/856/Galleries/7280/56009_save%20grace2.jpg',
                ]
            },
            {
                "title": "مبادرة أكرمك فأكرمة",
                "owner": " د.سماء عطية وعدد من منسوبات الكلية",
                "email": "smattiyah@uj.edu.sa",
                "date": "11-5-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "تجميع المصاحف غير المستخدمة أو الممزقة لإعادتها لشكاها الصحيح وتوزيعها للمحتاجين إليها بجميع أنحاء العالم",
                "outcome": [
				"تشجيع الناس على حفظ القران الكريم وتكريمة",
				"إستفادة الأخرين المحتاجين من جميع أنحاء العالم",
				"إستفادة الغير ناطقين بالعربية من المصاحف المترجمة",
				],
                "place": "مساجد ومراكز مختلفة بجدة ومحافظة الكامل",
                "vol_count": "11",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56002_quran.JPG',
		    'https://www.uj.edu.sa/Files/856/Galleries/7280/56003_quran2.JPG',
		    'https://www.uj.edu.sa/Files/856/Galleries/7280/56004_report.jpg',
                ]
            },
            {
                "title": "السلامة الصحية في ظل جائحة كورونا",
                "owner": "د.هدى السيد , د.زينب هاشم",
                "email": "hemohammed@uj.edu.sa",
                "date": "10-3-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "لقاء حواري عن أعراض المرض وكيفية الوقاية",
                "outcome": [
				"توعية الحماية من الفيروس",
				"الإحترازات الضرورية للحماية",
				"توعية عن اللقتحات وضرورة التحصين",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "7",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56006_safety%20in%20corona.jpg',
                ]
            },
	    {
                "title": "دثروهم2",
                "owner": "أ.صافية السلمي",
                "email": "skalsolami@uj.edu.sa",
                "date": "25-6-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "مبادرة تطوعية لتوفير جاكيتات شتوية للمحتاجين وخاصة العمالة المقيمة بالمحافظة ووضعها بالمساجد ليسهل الحصول عليها",
                "outcome": [
				"مساعدة العمالة غير القادرين على توفير الملابس الشتوية لهم",
				"حث المجتمع على الإحساس بالأخرين",
				"بث روح التعاون بين أفراد المجتمع",
				],
                "place": "مسجد الملك فهد بمحافظة الكامل",
                "vol_count": "11",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56015_cover3.JPG',
		    'https://www.uj.edu.sa/Files/856/Galleries/7280/56013_coverthem.JPG',
		    'https://www.uj.edu.sa/Files/856/Galleries/7280/56014_cover2.JPG',
                ]
            },
            {
                "title": "السلامة المرورية للمشاة",
                "owner": "د.فاطمة كساب",
                "email": "fkalhmoud@uj.edu.sa",
                "date": "24-7-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "محاضرة توعوية لتعريف بقواعد السلامة المرورية للمشاة",
                "outcome": [""],
                "place": "",
                "vol_count": "",
                "hours": "",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56011_traffic%20safety.jpg',
                ]
            },
            {
                "title": "السلامة المرورية لسائقي المركبات",
                "owner": "د.فاطمة كساب",
                "email": "fkalhmoud@uj.edu.sa",
                "date": "25-7-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "عمل تطوعي يهدف إلى زيادة الوعي بقواعد السلامة المرورية",
                "outcome": [
				"المساعدة على فهم لافتات المرور وكيفية قرائتها",
				"الحث على العمل بأحكام السلامة المرورية وكيفية التغلب على مخاطر الطريق",
				"رفع الوعي بمخاطر استخدام الهاتف أثناء القيادة",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "7",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56010_traffic%20safety%20for%20motorists.jpg',
                ]
            },
            {
                "title": "السلامة في استخدام الأدوية ومستحضرات التجميل",
                "owner": "د.نورا العبادي",
                "email": "nalabadi@uj.edu.sa",
                "date": "3-8-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "لقاء حواري عن السلامة في استخدام مساحيق التجميل والفيتامينات",
                "outcome": [
				"توعية عن السلامة في اسإخدام مساحيق التجميل",
				"أضرار الأفراط في إستخدام الفيتامينات",
				"نصائح لبشرة جميلة صحية بدون مكياج",
				],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "6",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56007_safety%20in%20the%20use%20of%20medicines.jpg',
                ]
            },
            {
                "title": "السلامة في معامل الحاسب الآلي",
                "owner": "أ.فاطمة السلمي",
                "email": "aeaalsulami1@uj.edu.sa",
                "date": "5-8-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "محاضرة تثقيفية وتوعوية لتعريف بوسائل السلامة في معامل الحاسب الآلي وكيف نحمي الأجهزة ضمن مبادرة السلامة في حياتنا اليومية",
                "outcome": [
				"التعريف بقواعد السلامة في التعامل مع جهاز الحاسب الآلي من حيث الجلسة الصحيحة وكيف نحافظ على سلامة النظر",
			        "التعرف على قواعد السلامة داخل المعمل وكيفية حماية الأجهزة داخل المعمل",
			        "التعرف على وسائل الأمن والسلامة التي يجب توفرها في المعمل",
			   ],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "4",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56012_%D8%B4%D8%B1%D9%8A%D8%AD%D8%A91.JPG',
                ]
            },
            {
                "title": "السلامة المنزلية لكبار السن وذوي الاحتياجات الخاصة",
                "owner":  "د.فاطمة الرواشدة",
                "email": "",
                "date": "25-8-1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "description": "محاضرة تثقيفية وتوعوية لتعريف بقواعد السلامة المنزلية لكبار السن وذوي الاحتياجات الخاصة",
                "outcome": ["أهميةالتعامل مع كبارالسن وذوي الاحتياجات الخاصة",
				"التوعية بوسائل السلامة المنزلية",
			   ],
                "place": "عبر منصة البلاك بورد",
                "vol_count": "2",
                "pics": [
                    'https://www.uj.edu.sa/Files/856/Galleries/7280/56005_home%20safety.jpg',
                ]
            }
        ],
    }
});
