var app = new Vue({
    el: "#app",
    methods: {
        showMoreInfo: function(item){
            this.modalData = item;
            const myModal = new bootstrap.Modal(document.querySelector('#moreInfo'))
            myModal.show();
        }
    },
    data: {
        modalData: {
            "title": "",
            "type": "",
            "owner": "",
            "date": "",
            "committee": "",
            "pics": [
                '#',
            ]
        },
        wt1441: [
            {
                "title": "مبادرة حقيبة تعليمية إلكترونية للصفوف الأولية",
                "type": "مبادرة تطوعية",
                "owner": "عدد من منسوبات الكلية",
                "date": "20-4-1442هـ",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "مبادرة إيزي إنجليزي",
                "type": "مبادرة تطوعية",
                "owner": "د.هبة الله عرابي وعدد من طالبات قسم اللغة الإنجليزية",
                "date": "20-4-1442هـ",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "مبادرة حفظ النعمة",
                "type": "مبادرة تطوعية",
                "owner": "عدد من منسوبات الكلية",
                "date": "21-4-1442هـ",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "مبادرة أكرمك فأكرمة",
                "type": "مبادرة تطوعية",
                "owner": "عدد من منسوبات الكلية",
                "date": "11-5-1442هـ",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة من عدوى فيروس كورونا",
                "type": "محاضرة",
                "owner": "د.هدى السيد , د.زينب هاشم",
                "date": "الثلاثاء , 10-3-1442هـ",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة المرورية للمشاة",
                "type": "محاضرة",
                "owner": "د.فاطمة كساب",
                "date": "الأثنين , 24/7/1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة المرورية لسائقي المركبات",
                "type": "محاضرة",
                "owner": "د.فاطمة كساب",
                "date": "الثلاثاء , 25/7/1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة في استخدام الأدوية ومستحضرات التجميل",
                "type": "محاضرة ",
                "owner": "د.نورا العبادي",
                "date": "الثلاثاء , 3/8/1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "السلامة في معامل الحاسب الآلي",
                "type": "محاضرة",
                "owner": "أ.فاطمة السلمي",
                "date": "الخميس 5/8/1442",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            },
            {
                "title": "طرق اجتياز اختبار القدرات اللفظية",
                "type": "محاضرة",
                "owner": "د.زينب هاشم , د.فاطمة الرواشدة",
                "date": "الأحد 8/8/1442هـ",
                "committee": "وحدة خدمة المجتمع والعمل التطوعي",
                "pics": [
                    '#',
                ]
            }
        ],
    }
});
